# coding: utf-8

# Python. Быстрый старт.
# Занятие 1.

# Домашнее задание: установить интерпретатор;
#    выполнить действия в интерпретаторе;
#    дописать скрипт, чтобы он перед приветствием выводил название программы


# Строка, начинающаяся с решётки #  - это комментарий, т.е. не выполняется

# Функция print выводит сообщение в командной строке
print('Моё название гораздо большее чем тебе стоило бы знать')
print("Привет, программист!")
print('теперь рассмотрим варианты вычислений:')
print('10 / 3 = ',10/3) #выводит остаток после деления
print('10 // 3 = ', 10//3) #целочисленное деление, знак после запятой отбрасывается
print('10 % 3 = ', 10%3) #результатом является остаток после целочисленного деления
print('10 ** 3 = ', 10**3) #возведение числа в степерь
print('10 * 3 + 1 = ', 10 * 3 + 1) #приоритет знаков сначала * потом +
print('10 * (3 + 1) = ', 10 * (3 + 1)) #приоритет знаков - сначала всё что в скобках, потом умножение
# Функция input запрашивает ввод данных у пользователя
input()
