# coding: utf-8

# Python. Быстрый старт.
# Занятие 1.

# Домашнее задание: установить интерпретатор;
#    выполнить действия в интерпретаторе;
#    дописать скрипт, чтобы он перед приветствием выводил название программы


# Строка, начинающаяся с решётки #  - это комментарий, т.е. не выполняется

# Функция print выводит сообщение в командной строке
print('Моё название гораздо большее чем тебе стоило бы знать')
print("Привет, программист!")
print('теперь рассмотрим варианты вычислений:')
print('10 / 3 = ',10/3)
print('10 // 3 = ', 10//3)
print('10 % 3 = ', 10%3)
print('10 ** 3 = ', 10**3)
print('10 * 3 + 1 = ', 10 * 3 + 1)
print('10 * (3 + 1) = ', 10 * (3 + 1))
# Функция input запрашивает ввод данных у пользователя
input()
